[
  {
    "@id": "http://gsi.dit.upm.es/Rumiyah2-Paths-to-Victory---Part-1",
    "@type": [
      "http://schema.org/Article"
    ],
    "http://schema.org/articleBody": [
      {
        "@value": "Part 1\nAll  praise  belongs  to  Allah,  Lord  of  Might, Lord of the creation, Supporter of this religion. There is no god but Him. He grants the truth victory, even if after some time. And may blessings and peace be upon the Imam of the Messengers, and may Allah be pleased with his companions from the Ansar and the Muhajirin. To proceed:Allah  said, “They want to extinguish the light  of  Allah  with  their  mouths,  but  Allah  refuses  except  to  complete  His  light,  even  if  the disbelievers hate it. He is the One who sent His Messenger  with  guidance  and  the  religion  of truth to make it prevail over all religion, even if the mushrikin despise such” (At-Tawbah 32-33). Thus, every Muslim must be certain that complete  victory  is  coming,  that  Allah  will  honor this religion, that the future belongs to it, even if all nations rabidly contend against us, and that we shall definitely rule the earth by the might of Allah,  the  Powerful,  the  Strong.  And  whoever rejects or doubts that is nothing but one of the disbelieving  fearmongers.\nAllah,  the  True  King,  said,  “And  We  have written  in  the  Zabur  after  previous  revelation that the earth shall be inherited by My righteous slaves. Verily in that is a message to a worshiping  people”  (Al-Anbiya  105-106).  The  truthful and trusted prophet  said, “This matter shall reach  all  that  the  night  and  day  have  reached, and Allah will not leave a house of mud or fur [i.e. dwellings in the city or desert] except that He will make this religion enter it, through glory or humiliation – glory by which Allah glorifies Islam and humiliation by which Allah humbles the disbelievers” (Reported by Ahmad). This was narrated  by Tamim  ad-Dari,  who  then  said,  “I recognized that in my own household. Those of them who accepted Islam received much good, honor,  and  glory.  And  those  of  them  who  remained in kufr were afflicted with humiliation, subservience,  and  the  jizyah.”\nThe  people  of  tawhid  must  know  that  a ‘aqidah  (creed)  for  which  pure  blood  has  been spilled and for which shuhada have fought, lived, and died will definitely be victorious. Its arrows will extend to strike the neck of every kafir. And it  will  enlighten  the  heart  of  every  muwahhid. \n18Article\nBut we must all realize that the condition for victory is following the Prophet . If this adherence is present, victory shall  come,  and  if  it  is  absent,  there  shall  be  no  victory. No other cause rivals it, as the scholars have explained. Ibnul-Qayyim  said, “As such, victory and complete support is only for the people of complete iman. Allah  said, ‘Indeed, We shall support Our messengers and those who believed, in the worldly life and on the day the witnesses rise’ (Ghafir 51), and He said, ‘So We empowered those who believed against their enemy, so they became victors’ (As-Saff 14). Thus, whoever is lacking in iman will also lack in his portion of victory and support” (Ighathat al-Lahfan).The Prophet  also guided us – with great detail – to both the causes for victory and the hindrances to achieving it. Ibnul-Qayyim  said, “Thus did he  teach them the tactics of war and confronting the enemy, as well as the paths to victory and triumph – such that if they were to learn them, comprehend them, and maintain them as they should be maintained, there would never be an enemy that could stand against them” (I’lam al-Muwaqqi’in).\nAnd from the several causes for victory is tawhid. Allah  said, “And they will not cease to fight you until they make you turn from your religion if they are able” (Al-Baqarah 217), and He  said, “They only resented them because they believed in Allah, the Mighty, the Praised” (Al-Buruj 8). This is the reality, which all mujahidin must comprehend.\nThe battle between the muwahhidin and the kafirin is fundamentally a battle of ‘aqidah, and Allah has confined \nArticle\fing them was that all their men were to be killed and their women and children enslaved.\n‘Aishah  narrates, “Sa’d [Ibn Mu’adh] was wounded on the day of the trench when a man from Quraysh called Ibn al-‘Ariqah shot him [with an arrow] hitting an artery in his arm. Hence, Allah’s Messenger  set up a tent for Sa’d in the masjid to be close to him. When Allah’s Messenger  came back from the trench, he put down his sword and bathed. Jibril , shaking the dust off his head, came to him and said, ‘You have laid down the sword? By Allah, we have not laid ours down. Set out for them.’ Allah’s Messenger  said, ‘Where?’ Jibril pointed towards Bani Quraydhah. Allah’s Messenger  then attacked them. They later surrendered to the judgment of Allah’s Messenger , and Allah’s Messenger  referred the judgment concerning them to Sa’d. Sa’d said, ‘My judgment concerning them is that their fighters are to be killed, their women and children are to be enslaved, and their wealth is to be divided.’ ‘Urwah Ibn az-Zubayr said, ‘I was told that the Prophet  said, ‘You have judged them by the judgment of Allah’’” (Reported by Muslim). And thus, brutality towards those traitors served as a beneficial remedy, and a lesson and a warning to others.Prior to that, the Prophet  had expelled Bani an-Nadir from their homes and took their wealth as ghanimah after Allah  revealed to him their plot to assassinate him while he was in their presence. It was not long before he set out, besieging them and waging war against them, with Allah then granting him victory over them. He  also fought Bani Qaynuqa’ and besieged them and did the same with the Jews of Khaybar, fighting them and conquering their fortresses by force (Sirat Ibn Hisham).\nAllah’s Messenger  likewise would not be silent concerning the right of those Muslims killed treacherously and unjustly, unlike the evil scholars who discourage the Muslims from rising up and taking revenge against those kuffar who kill them, spill their blood, and violate their women. Ibn Kathir said, “Al-Waqidi said, ‘In the month of Shawwal, the 6th year after the Hijrah, the detachment of Kurz Ibn Jabir al-Fihri was sent to the ‘Uraniyyin who killed the shepherd of Allah’s Messenger  and herded away the camels.’”\nAnas    narrated  that  a  group  of  people  from  ‘Ukl and  ‘Uraynah  came  to  the  Prophet    openly  manifesting Islam, and said, “O Prophet of Allah, indeed we are a people of livestock and not a people of agriculture.” They could not bear the nature of Madinah and had gotten ill. So the Prophet  ordered that they be lent a number of camels and a shepherd, and ordered the group from ‘Ukl and  ‘Uraynah  to  head  out  with  the  shepherd  and  drink the milk and urine of the camels. They set out, and when they reached the area of the lava field, they disbelieved after having embraced Islam, killed the Prophet’s shepherd, and herded away the camels. This then reached the Prophet , so he dispatched a party in their pursuit and gave them orders [on how to punish them]. So they melted their eyes with heated nails, cut off their hands, and left them in the area of the lava field until they died in that state (Reported by al-Bukhari and Muslim).\nThis was the punishment done by Allah’s Messenger . Even though he had forbidden mutilation, taking retribu-\ntion from these criminal apostates and their likes is something established in the religion. Thus, he did not let the killers of his shepherd go free. Rather, he sent a detachment to detain them and carry out the ruling of retribution on them.\nAnd during the conquest of Makkah (may Allah bring it back under the rule of the Muslims), Allah’s Messenger  ordered for a number of individuals to be killed even if they were found clinging to the curtains of the Ka’bah. Anas  narrated that the Prophet  entered Makkah the year of the conquest wearing a helmet. When he took it off, a man came to him and said, “Ibn Khatal is clinging to the curtains of the Ka’bah.” He responded, “Kill him” (Reported by al-Bukhari and Muslim).\nSa’d Ibn Abi Waqqas  said, “On the day of the conquest of Makkah, Allah’s Messenger  granted amnesty to all the people except four men and two women, saying, ‘Kill them, even if you find them clinging to the curtains of the Ka’bah’” (Reported by an-Nasai).\nThis prophetic order was also due to their harming Islam and the Muslims. The curtains of the noble Ka’bah could not shield them from the law of the Lord of the creation after the severe kufr they had perpetrated with their hands and tongues.\nThese evidences from the Sirah of the Messenger  – and there are many others – do not negate from him the characteristic of compassion and mercy. Rather, these traits are in accordance with Allah’s words, “Muhammad is the Messenger of Allah; and those with him are severe against the disbelievers, merciful among themselves” (Fath 29). Allah’s Messenger  carried out the command of Allah , who said, “O you who have believed, fight those disbelievers near you and let them find brutality in you” (At-Tawbah 123).\nLikewise, just as he  is the prophet of mercy, he is also the prophet of slaughter. As for taking his compassion and mercy for the allies of Allah and applying it to the enemies of Allah, then this is the methodology of the taghut scholars who want the Muslims to compromise with their enemies. Rather, the taghut scholars want the Muslims to obey their enemies as much as possible. And if the Muslim rushes to massacre the enemies of Allah and does to them just as they have done to the Muslims, including killing and humiliating them, these devils hasten to denounce him, “warning” against the image of Islam and the Muslims being distorted. But of which “Islam” do they speak and what religion do they follow?! The religion of the taghut scholars is nothing but apostasy, which can only be cleansed by unsheathing the sword of Abu Bakr as-Siddiq .\nPart 2: In the History of the Rashid Khulafa \nThe Sahabah  were people with the softest of hearts, the best of them in morals and character, and the most sincere of them in da’wah, spreading the religion, and raising the banner of Islam. They were the most serious of people in holding tightly to the Sunnah of the Messenger  in all matters. Amongst these matters, was his guidance in dealing with the kuffar during war. The Sahabah were severe against the kuffar, showing harshness to them by sword and \n\f"
      }
    ],
    "http://schema.org/author": [
      {
        "@value": "isis"
      }
    ],
    "http://schema.org/headline": [
      {
        "@value": "Paths to Victory - Part 1"
      }
    ],
    "http://schema.org/pageStart": [
      {
        "@value": "17"
      }
    ],
    "http://www.w3.org/ns/prov#wasDerivedFrom": [
      {
        "@id": "http://gsi.dit.upm.es/Rumiyah2"
      }
    ],
    "http://www.w3.org/ns/prov#wasGeneratedBy": [
      {
        "@id": "http://gsi.dit.upm.es/#scrapingActivity"
      }
    ]
  },
  {
    "@id": "http://gsi.dit.upm.es/Dabiq11-THE-EVIL-OF-DIVISION-AND-TAQLĪD",
    "@type": [
      "http://schema.org/Article"
    ],
    "http://schema.org/articleBody": [
      {
        "@value": "the people divided their religion among them into sects – each faction, in what it has, rejoicing} [Al-Mu’minūn: 53]. They are also divided about their dunyā and they consider this good. So he  came with unity regarding the religion with Allah’s statement, {He has ordained for you  of  religion  what  He  enjoined  upon  Nūh  and  that which We have revealed to you, and what We enjoined upon  Ibrāhīm  and  Mūsā  and  ‘Īsā  –  to  establish  the religion  and  not  be  divided  therein}  [Ash-Shūrā:  13]. Allah  also said, {Indeed, those who have divided their religion and become sects – you have nothing to do with them}  [Al-An’ām:  159].  He  also  prohibited  us  from being like them with Allah’s statement, {And do not be like the ones who became divided and differed after the clear proofs had come to them. And those will have a great punishment} [Āl ‘Imrān: 105]. He also prohibited us from dividing about the dunyā with Allah’s statement, {And hold firmly to the rope of Allah all together and do  not  become  divided}  [Āl  ‘Imrān:  103].  The  third of these matters is that they considered disobeying the person in authority and refusing to yield to him a virtue. They considered hearing and obeying him humiliation and  disgrace.  Allah’s  Messenger    opposed  them  and ordered his companions to be patient with the injustices of the rulers2. He ordered them to hear and obey them and give them sincere advice. He was severe about this, expressed it, and repeated it. These three matters he  gathered together in the hadīth reported by al-Bukhārī and  Muslim,  ‘Allah  is  pleased  with  three  matters  for you, that you worship Him and not associate anything with Him in worship, that you hold to the rope of Allah together  and  not  divide,  and  that  you  sincerely  advise those whom Allah gives authority over you.’ No calamity occurred  in  the  people’s  religion  and  dunyā  except  by violation  of  these  three  principles  or  some  of  them” [Masā’il al-Jāhiliyyah].\nHe    also  said,  “From  the  most  amazing  things  and greatest  signs  showing  the  power  of  Allah    are  six principles  that  He    made  very  clear  more  so  than what  the  doubtful  people  think.  Thereafter,  many  of the  ‘intelligent’  people  of  the  world  and  ‘wise’  men  of mankind erred about these principles, except for a very few.  …  The  second  principle  [after  the  obligation  of tawhīd  and  prohibition  of  shirk]  is  that  Allah  ordered with unity regarding the religion and prohibited division within it. Allah clarified this with clear and conclusive evidence that the laymen can understand. He prohibited us from being like those who divided before us and thus were  destroyed.  He  also  mentioned  that  He  ordered the  Messengers  with  unity  regarding  the  religion  and 2 He refers to Muslim rulers who rule by the Sharī’ah but commit injustices, not rulers who apostatize by legislating, executing, or judging by manmade laws, nor rulers who have walā’ to the crusaders against the Muslims.\nprohibited  them  from  division  within  it.  What  makes this  clearer  is  what  the  Sunnah  came  with  of  amazing teachings in this regards. Then the matter changed until division  over  the  fundamentals  and  branches  of  the religion  became  ‘knowledge’  and  ‘fiqh  of  the  religion’! And  then  no  one  called  to  the  obligation  to  unite regarding the religion except for a ‘zindīq’ or ‘madman’! The third principle is that the fulfillment of unity is by hearing and obeying he who has been granted authority over  us  even  if  he  might  be  an  Ethiopian  slave.  Allah clarified this prevalently and sufficiently through various kinds of shar’ī and qadarī evidences. It then became the fundamental  not  known  to  most  of  the  claimants  of knowledge. What then of acting in accordance with this matter!” [Six Great Beneficial Fundamentals].\nAnd  although  jamā’ah  is  from  the  most  obvious  of obligations with even the fitrah of many animals being inclined to it, the modern claimants of Islam argue that it is better for the Ummah to have religious and political pluralism!  They  prefer  that  Ahlus-Sunnah  tolerate  the various  sects  of  bid’ah  and  even  apostasy  who  claim to belong to the Muslim Ummah. They also wish that Ahlus-Sunnah  would  permit  the  existence  of  deviant, warring, and selfish political parties and militant factions on the liberated Muslim lands! They made taqlīd (blind following)  of  their  partisan,  evil  “scholars”  an  essential aspect of “religion.” And through this, they propagated the  “virtue”  of  division  and  denounced  the  “evil”  of jamā’ah  in  their  campaign  against  the  revived  body  of Islam, the Khilāfah. How wicked are the deviant parties and corrupt “scholars”!\nTherefore  know  –  may  Allah  have  mercy  upon  you  – that  the  major  basis  for  the  religions  of  the  Jāhiliyyah was taqlīd. After Imām Muhammad Ibn ‘Abdil-Wahhāb   mentioned  the  first  three  aspects  of  their  religion (shirk, religious division, and political disunity), he said, “The fourth matter is that their religion is based upon principles, the greatest of which is taqlīd. It is the major principle for all the kuffār, the first of them and last of them, as Allah  said, {And similarly, We did not send before you any warner into a city except that its affluent said, “Indeed, we found our fathers upon a religion, and we are, in their footsteps, following”} [Az-Zukhruf: 23]. He  also said, {And when it is said to them, “Follow what Allah has revealed,” they say, “Rather, we will follow that upon which we found our fathers.” Even if Shaytān was inviting them to the punishment of Hellfire?} [Luqmān: 21]. So he  came to them with Allah’s statement, {Say, “I only advise you of one thing – that you stand for Allah, [seeking truth] in pairs and individually, and then give thought.” There is not in your companion any madness. \ndabiq\n\fonly begin his killings by killing Quraysh. He will not accept from them anything but war and he will not offer them anything but the sword.” An-Nu’mānī also reports that Ja’far as-Sādiq said, “When al-Qā’im from the family of the Prophet emerges, he will bring five hundred people from Quraysh and strike their necks. He will then bring five  hundred  more  and  strike  their  necks.  He  will  do so  six  times  [thereby  killing  three  thousand  men  from Quraysh].  He  will  kill  them  and  their  patrons.”  He also  reports  that  Ja’far  as-Sādiq2  said,  “When  al-Qā’im emerges,  nothing  will  be  between  him  and  both  the Arabs and Quraysh except the sword.”\nSo  the  Rāfidī  “Mahdī”  speaks  in  Hebrew,  rules  by  the Torah,  is  followed  by  the  Jews,  and  kills  the  Arabs especially Quraysh! Is this a description of the Mahdī or the  Dajjāl?  Consider  that  seventy  thousand  Jews  from Asbahān  (Isfahan  of  modern-day  Iran)  will  follow  the Dajjāl as in the hadīth reported by Muslim from Anas .\nAlso consider that the Dajjāl will emerge from the region of the Khawārij as in the hadīth reported by Ibn Mājah from Ibn ‘Umar . And also consider that those who deny  Qadar  are  from  the  followers  of  the  Dajjāl  as  in the hadīth reported by Abū Dāwūd from Hudhayfah . This is important for two reasons, the Rāfidah are from the  biggest  Khārijī  sects.  They  and  the  other  Khawārij have a common root in the Jew ‘Abdullāh Ibn Saba’, who partook  in  the  mutiny  against  the  righteous  Khalīfah ‘Uthman  .  For  this  reason,  some  of  the  scholars have also referred to the Khawārij as “Saba’iyyah.”3  In 2 Note that Muhammad al-Bāqir, Ja’far as-Sādiq, and al-Hasan al-‘Askarī  were not Rāfidah. They were from the family of the Prophet  just as ‘Alī, Fātimah, al-Hasan, and al-Husayn  were from the family of the Prophet . And just as the Rāfidah fabricated lies in the name of ‘Alī and his immediate family , they fabricated lies in the name of his noble descendants .3 The closeness of the Rāfidah to the other Khawārij is visible in the walā’ between Iran \n70,000 Jews from Asbahān will follow the Dajjāl\naddition,  the  Rāfidah  are  infamous  for  pronouncing takfīr  upon  the  majority  of  the  Ummah  including  the best of the Ummah – the Companions of the Prophet  – rejecting the authority of the khulafā’, even cooperating with  the  Crusaders  and  the Tatars  against  the  khulafā’ and their Muslim subjects. The Rāfidah have a history of  massacring  Muslims  who  refuse  Rāfidī  beliefs.  This became most manifest during the Safawī empire (“15011736CE”) and its war against Ahlus-Sunnah in Persia. Finally, the Rāfidah are one of the sects of Qadariyyah, as they deny that good and evil deeds are by Allah’s qadar.\nHence  the  apostate  Rāfidah  combined  between  major shirk (worship of the family of the Prophet ), denial of  the  Qur’ān  and  the  Sunnah  (as  they  claim  the Companions  fabricated the religious texts), takfīr of the Companions   and the Mothers of the Believers , and belief in the deviant innovations of the Khawārij and Qadariyyah. When reflecting upon this and the fact that the Jews await their so-called Messiah – as the Jews deny  the  messengership  of  Jesus  ,  who  will  return before the Hour – it is expected that the Rāfidah will ally blatantly with the Jews in the future in their war against Islam and the Muslims.4 \nWe  seek  refuge  with  Allah  for  Ahlus-Sunnah  from  the evil of the Dajjāl.\nand Oman. Oman is ruled solely and populated mostly by the Ibādiyyah. The Ibādiyyah are historically a deviant Khārijī sect; but over the last centuries they have mutated into an apostate Jahmī sect. Their tāghūt “sultan” legislates manmade laws and has walā’ to the Crusaders, the Arab and non-Arab tawāghīt including Āl Salūl, and the Rāfidah.4 Although it is not possible to know with certainty how exactly such will come about, it is interesting to note that 340 Jewish American rabbis recently wrote a letter addressed to the American congress in support of American-Iranian reconciliation, as reported by “I24News” (a Jewish news channel) on “18 August 2015” in an article titled “Hundreds of US Rabbis Voice Support for Iran Nuclear Deal.” The report adds that the Jewish Defense Forces Military Intelligence Directorate’s Research Department presented its stance to the political leadership of the Jewish state and “emphasized the possible benefits that could come of the deal.”\ndabiq\n\f"
      }
    ],
    "http://schema.org/author": [
      {
        "@value": "isis"
      }
    ],
    "http://schema.org/headline": [
      {
        "@value": "THE EVIL OF DIVISION AND TAQLĪD"
      }
    ],
    "http://schema.org/pageStart": [
      {
        "@value": "10"
      }
    ],
    "http://www.w3.org/ns/prov#wasDerivedFrom": [
      {
        "@id": "http://gsi.dit.upm.es/Dabiq11"
      }
    ],
    "http://www.w3.org/ns/prov#wasGeneratedBy": [
      {
        "@id": "http://gsi.dit.upm.es/#scrapingActivity"
      }
    ]
  }
]
